jimmywong2003/nrf5-ble-multiple-role-example/ble_app_lbs_nus_its_multi-role/main.c
        err_code = ble_its_init(&m_its, &its_init);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module that
 *          are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply
 *       setting the disconnect_on_fail config parameter, but instead we use the event
 *       handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
        ret_code_t err_code;

        if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
        {
                err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
                APP_ERROR_CHECK(err_code);
        }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
        ret_code_t err_code;
        ble_conn_params_init_t cp_init;

        memset(&cp_init, 0, sizeof(cp_init));

        cp_init.p_conn_params                  = NULL;
        cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
        cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
        cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
        cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
        cp_init.disconnect_on_fail             = false;
        cp_init.evt_handler                    = on_conn_params_evt;
        cp_init.error_handler                  = conn_params_error_handler;

        err_code = ble_conn_params_init(&cp_init);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
        ret_code_t err_code;

        err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
        APP_ERROR_CHECK(err_code);

        bsp_board_led_on(ADVERTISING_LED);
}

static void on_peripheral_connected(ble_gap_evt_t const * p_gap_evt)
{
        ret_code_t err_code;

        uint32_t periph_link_cnt = ble_conn_state_peripheral_conn_count();    // Number of peripheral links.

        NRF_LOG_INFO("on_peripheral_connected");
        NRF_LOG_INFO("Connection with link 0x%x established.", p_gap_evt->conn_handle);


        err_code = app_button_enable();
        APP_ERROR_CHECK(err_code);

        if (periph_link_cnt == NRF_SDH_BLE_PERIPHERAL_LINK_COUNT)
        {
                bsp_board_led_off(ADVERTISING_LED);
        }
        else
        {
                // Continue advertising. More connections can be established because the maximum link count has not been reached.
                advertising_start();
        }

        // NRF_LOG_INFO("Connected");
        // bsp_board_led_on(CONNECTED_LED);
        // bsp_board_led_off(ADVERTISING_LED);
        // m_conn_handle = p_gap_evt->conn_handle;
        // err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
        // APP_ERROR_CHECK(err_code);
        // err_code = app_button_enable();
        // APP_ERROR_CHECK(err_code);
        // tx_power_set();
}


static void on_peripheral_disconnected(ble_gap_evt_t const * p_gap_evt)
{
        // ret_code_t err_code;
        // NRF_LOG_INFO("Disconnected");
        // bsp_board_led_off(CONNECTED_LED);
        // m_conn_handle = BLE_CONN_HANDLE_INVALID;
        // err_code = app_button_disable();
        // APP_ERROR_CHECK(err_code);
        // advertising_start();

        ret_code_t err_code;

        NRF_LOG_INFO("on_peripheral_disconnected");

        uint32_t periph_link_cnt = ble_conn_state_peripheral_conn_count();    // Number of peripheral links.

        NRF_LOG_INFO("Connection 0x%x has been disconnected. Reason: 0x%X",
                     p_gap_evt->conn_handle,
                     p_gap_evt->params.disconnected.reason);

        if (periph_link_cnt == 0)
        {
                bsp_board_led_off(CONNECTED_LED);
                err_code = app_button_disable();
                APP_ERROR_CHECK(err_code);
        }

        if (periph_link_cnt == (NRF_SDH_BLE_PERIPHERAL_LINK_COUNT - 1))
        {
                // Advertising is not running when all connections are taken, and must therefore be started.
                advertising_start();
        }
}

static void on_central_connected(ble_gap_evt_t const * p_gap_evt)
{
        ret_code_t err_code;

        NRF_LOG_INFO("Connection 0x%x established, starting DB discovery.",
                     p_gap_evt->conn_handle);

        APP_ERROR_CHECK_BOOL(p_gap_evt->conn_handle < NRF_SDH_BLE_CENTRAL_LINK_COUNT);

        err_code = ble_lbs_c_handles_assign(&m_ble_lbs_c[p_gap_evt->conn_handle], p_gap_evt->conn_handle, NULL);
        APP_ERROR_CHECK(err_code);

        err_code = ble_nus_c_handles_assign(&m_ble_nus_c[p_gap_evt->conn_handle], p_gap_evt->conn_handle, NULL);
        APP_ERROR_CHECK(err_code);

        err_code = ble_its_c_handles_assign(&m_ble_its_c[p_gap_evt->conn_handle], p_gap_evt->conn_handle, NULL);
        APP_ERROR_CHECK(err_code);

        err_code = ble_db_discovery_start(&m_db_disc[p_gap_evt->conn_handle], p_gap_evt->conn_handle);
        APP_ERROR_CHECK(err_code);

        // tx_power_set();

        // Update LEDs status and check whether it is needed to look for more
        // peripherals to connect to.
        // bsp_board_led_on(CENTRAL_CONNECTED_LED);
        if (ble_conn_state_central_conn_count() == NRF_SDH_BLE_CENTRAL_LINK_COUNT)
        {
                // bsp_board_led_off(CENTRAL_SCANNING_LED);
        }
        else
        {
                // Resume scanning.
                // bsp_board_led_on(CENTRAL_SCANNING_LED);
                scan_start();
        }

